<?php

namespace Database\Seeders;

use App\Models\City;
use App\Models\Province;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CitiesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $cities = [
            "آذربایجان شرقی" => ["تبریز", "مراغه", "میانه", "اهر", "کلیبر", "سراب", "بناب", "میاندوآب", "هشترود", "اسکو"],
            "آذربایجان غربی" => ["ارومیه", "خوی", "میاندوآب", "سلماس", "شاهین دژ", "ماکو", "پیرانشهر", "سردشت", "بوکان", "مهاباد"],
            "اردبیل" => ["اردبیل", "پارس آباد", "مشگین شهر", "خلخال", "کوثر", "نمین", "آستارا", "بیله سوار", "جلفا", "گرمی"],
            "اصفهان" => ["اصفهان", "شاهین شهر", "نجف آباد", "کاشان", "گلپایگان", "سمیرم", "خوانسار", "فریدن", "چادگان", "آران و بیدگل"],
            "البرز" => ["کرج", "ساوجبلاغ", "طالقان", "نظرآباد", "کرج"],
            "ایلام" => ["ایلام", "دهلران", "دره شهر", "مهران", "چرداول", "سیروان", "ملکش", "بدره"],
            "بوشهر" => ["بوشهر", "کنگان", "دیلم", "تیران", "دشتستان", "عسلویه"],
            "تهران" => ["تهران", "ری", "شهریار", "کرج", "ورامین", "سمنان"],
            "چهارمحال و بختیاری" => ["شهرکرد", "بروجن", "لردگان", "آبشار", "اردل", "فارسان", "کوهرنگ"],
            "خراسان جنوبی" => ["بیرجند", "قاین", "فردوس", "طبس", "نهبندان", "درمیان"],
            "خراسان رضوی" => ["مشهد", "نیشابور", "کاشمر", "تایباد", "تربت حیدریه", "سبزوار", "گناباد"],
            "خراسان شمالی" => ["بجنورد", "شیروان", "اسفراین", "فاروج", "گرمه", "جاجرم"],
            "خوزستان" => ["اهواز", "خرمشهر", "آبادان", "دزفول", "شوش", "اندیمشک", "بهبهان"],
            "زنجان" => ["زنجان", "ابهر", "خرمدره", "کانیوان", "طارم", "ماهنشان"],
            "سمنان" => ["سمنان", "شاهرود", "دامغان", "گرگان", "مهدیشهر", "سرخه"],
            "سیستان و بلوچستان" => ["زاهدان", "ایرانشهر", "چابهار", "زابل", "خاش", "بمپور"],
            "فارس" => ["شیراز", "مرودشت", "جهرم", "فسا", "لارستان", "کازرون", "فیروزآباد"],
            "قزوین" => ["قزوین", "کرج", "رودبار", "ساوجبلاغ", "البرز"],
            "قم" => ["قم"],
            "کردستان" => ["سنندج", "سقز", "بانه", "قروه", "کامیاران", "مریوان"],
            "کرمان" => ["کرمان", "رفسنجان", "جیرفت", "بم", "سیرجان", "کهنوج"],
            "کرمانشاه" => ["کرمانشاه", "اسلام آباد غرب", "پاوه", "قصر شیرین", "سرپل ذهاب", "کنگاور"],
            "کهگیلویه و بویراحمد" => ["یاسوج", "گچساران", "کهگیلویه", "بویراحمد", "لنده"],
            "گلستان" => ["گرگان", "گنبد کاووس", "علی آباد", "کردکوی", "بندرگز", "میناب"],
            "گیلان" => ["رشت", "انزلی", "لاهیجان", "فومن", "رودسر", "بندرعباس"],
            "لرستان" => ["خرم آباد", "بروجرد", "دورود", "کوهدشت", "پلدختر", "ازنا"],
            "مازندران" => ["ساری", "بابل", "نوشهر", "تنکابن", "رامسر", "بهشهر"],
            "مرکزی" => ["اراک", "ساوه", "خمین", "دلیجان", "محلات", "زرندیه"],
            "هرمزگان" => ["بندرعباس", "میناب", "بندرلنگه", "کیش", "قشم", "ابوموسی"],
            "همدان" => ["همدان", "ملایر", "نهاوند", "تویسرکان", "اسدآباد", "بهار"],
            "یزد" => ["یزد", "میبد", "اردکان", "ابارق", "بافق", "برگ جهان"]
        ];


        foreach ($cities as $provinceName => $cityNames) {
            $province = Province::where('name', $provinceName)->first();
            foreach ($cityNames as $cityName) {
                City::create(['name' => $cityName, 'province_id' => $province->id]);
            };
        };
    }
}
